"""
 Python中定义函数，可以用【必选参数，默认参数，可变参数，关键字参数，命名关键字参数】
 五种参数可以组合使用，需要注意，参数定义的顺序必须是：
       必选参数、默认参数、可变参数、命名关键字参数和关键字参数。

 对于任意函数，都可以通过类似func(*args, **kw)的形式调用它，无论它的参数是如何定义的
 虽然可以组合多达5种参数，但不要同时使用太多的组合，否则函数接口的可理解性很差
"""


def f1(a, b, c=0, *args, **kw):
    print('a=', a, 'b=', b, 'c=', c, 'args=', args, 'kw=', kw)


def f2(a, b, c=0, *args, job='teacher', **kw):
    print('a=', a, 'b=', b, 'c=', c, 'args=', args, 'job=', job, 'kw=', kw)


f1(1, 2)
f1(1, 2, 3)
f1(1, 2, c=3)
f1(1, 2, 3, 'a', 4, 'b')
f1(1, 2, 3, 'a', 4, 'b', x=11, y=22)
print('--------------------------------------------------------------------------------------')

f2(1, 2)
f2(1, 2, 3)
f2(1, 2, 3, 'a', 4, 'b')
f2(1, 2, 3, 'a', 4, 'b', job='doctor')
f2(1, 2, 3, 'a', 4, 'b', job='doctor', x=11, y=22)
f2(1, 2, 3, 'a', 4, 'b', x=11, job='doctor', y=22)
print('--------------------------------------------------------------------------------------')

# 通过一个tuple和dict，你也可以调用上述函数
# 对于任意函数，都可以通过类似func(*args, **kw)的形式调用它，无论它的参数是如何定义的
args = (1, 2, 3, 'a', 4, 'b')
kw = {'x': 11, 'y': 22}
f1(*args, **kw)
f2(*args, **kw)
