"""
    偏函数(Partial function):把一个函数的某些参数给固定住（也就是设置默认值），返回一个新的函数，调用这个新函数会更简单
"""

# int()函数默认是10进制的，当需要转换为其他进制的时候
print(int('123'))
print(int('12333', base=8))
print(int('100000', base=2))
print("__________________________________________________________________________________")


# 如果要进行大量的二进制转换，普通做法
def int2(x, base=2):
    return int(x, base)


print(int2('10011'))
print(int2('11111'))
print("__________________________________________________________________________________")

# 使用偏函数的方式
import functools

int2 = functools.partial(int, base=2)
print(int2('10011'))
print(int2('11111'))
print("__________________________________________________________________________________")
